{
  "backend/main.mo": "Motoko canister implementing user profiles, portfolios, and market-data fetchers with access control and Yahoo-backed HTTP outcalls.",
  "feature_evidence.json": "Feature evidence file listing implemented features, affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Reference file providing short summaries of numerous frontend components, hooks, and utilities.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and applying base styles.",
  "frontend/index.html": "Basic HTML entrypoint mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app with hash-based routing, auth handling, theming, and public vs authenticated page rendering.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and query cache clearing on logout.",
  "frontend/src/components/charts/AllocationDonutChart.tsx": "Recharts donut chart computing holding allocation values from quotes and rendering tooltip and legend.",
  "frontend/src/components/charts/PerformanceLineChart.tsx": "Displays a line chart of historical asset performance with selectable time ranges and loading/error states.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main application layout with a top navigation bar, toggleable sidebar, and content area.",
  "frontend/src/components/layout/Sidebar.tsx": "Shows a list of portfolios with real-time metrics, provides a create-portfolio button, and handles navigation.",
  "frontend/src/components/layout/TopNav.tsx": "Renders the top navigation bar with logo, portfolio switcher, ticker search, settings menu, and login button.",
  "frontend/src/components/market/LastUpdatedIndicator.tsx": "Displays a live-updating timestamp showing how many seconds have passed since the last update.",
  "frontend/src/components/market/TickerTypeahead.tsx": "Provides a searchable ticker input with debounced lookup, keyboard navigation, and selectable dropdown results.",
  "frontend/src/components/portfolio/AddEditHoldingModal.tsx": "Modal for adding or editing a portfolio holding, including ticker search, share and cost inputs, and form submission.",
  "frontend/src/components/portfolio/CreatePortfolioDialog.tsx": "Dialog for creating a new portfolio with a name input and form submission handling.",
  "frontend/src/components/portfolio/DeletePortfolioDialog.tsx": "Confirmation dialog that deletes a portfolio using a mutation and shows success or error toasts.",
  "frontend/src/components/portfolio/HoldingsTable.tsx": "Displays portfolio holdings with calculated metrics, loading skeletons, and optional edit/remove actions.",
  "frontend/src/components/portfolio/PortfolioCard.tsx": "Dashboard card showing portfolio value, returns, sparkline chart, and navigates to the portfolio on click.",
  "frontend/src/components/portfolio/PortfolioSharingPanel.tsx": "Panel for toggling portfolio public visibility and copying a generated shareable URL.",
  "frontend/src/components/portfolio/RemoveHoldingConfirm.tsx": "Confirmation dialog for removing a holding from a portfolio via mutation with toast feedback.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor tied to Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useDebouncedValue.ts": "Hook that returns a debounced version of a given value after a delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity auth state, login, logout, and identity persistence.",
  "frontend/src/hooks/useMarketData.ts": "Provides React Query hooks for live quotes, ticker search, and historical data, supporting both Yahoo Finance and CoinGecko with crypto ID caching.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on portfolios and holdings using the backend actor.",
  "frontend/src/hooks/useTheme.ts": "Implements a light/dark theme hook that syncs with localStorage and updates DOM classes.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables and base styles.",
  "frontend/src/lib/portfolioMath.ts": "Contains functions to compute holding-level and portfolio-level metrics such as market value, returns, and daily change.",
  "frontend/src/lib/symbols.ts": "Provides helpers for symbol normalization, crypto ID mapping, and parsing Yahoo and CoinGecko API responses.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/DashboardPage.tsx": "Displays all user portfolios with live quotes and loading states, rendering cards for each portfolio.",
  "frontend/src/pages/PortfolioDetailPage.tsx": "Shows detailed metrics, charts, and management actions for a single portfolio with live price updates.",
  "frontend/src/pages/PublicPortfolioPage.tsx": "Renders a public, read‑only portfolio page, fetching portfolio data and live quotes and displaying holdings, allocation, and performance charts.",
  "frontend/src/pages/TickerPreviewPage.tsx": "Shows a preview page for a ticker with live quotes, crypto detection, current price, and a 30‑day historical chart.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and manipulating hash-based query params.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, typography, container settings, animations, and plugins.",
  "project_state.json": "Describes the project’s state, architecture, known issues, and implemented features for the portfolio tracking app."
}