{
  "backend/main.mo": "Actor manages user profiles, portfolios, and market-data fetches with access control and Yahoo Finance HTTP outcalls.",
  "feature_evidence.json": "Feature evidence report placeholder with an empty features list.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files for documentation or build tooling.",
  "frontend/index.css": "Tailwind base/theme variables defining light and dark color systems and global styling.",
  "frontend/index.html": "HTML entry point mounting the root element and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Main app router handling hash-based navigation, authentication states, and theme selection for public vs private routes.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and cache clearing on logout.",
  "frontend/src/components/charts/AllocationDonutChart.tsx": "Pie chart showing portfolio allocation using only holdings with live quotes.",
  "frontend/src/components/charts/PerformanceLineChart.tsx": "Line chart displaying historical performance for a primary asset with range selection and loading/error states.",
  "frontend/src/components/layout/AppLayout.tsx": "Authenticated app layout with responsive sidebar behavior and top navigation.",
  "frontend/src/components/layout/Sidebar.tsx": "Displays portfolios with live metrics, navigation, and a dialog to create new portfolios. Fetches portfolio data and quotes, showing loading states and value/change indicators.",
  "frontend/src/components/layout/TopNav.tsx": "Renders the top navigation bar with sidebar toggle, branding, ticker search, theme switch, and portfolio dropdown. Handles navigation and mobile search dialog state.",
  "frontend/src/components/market/LastUpdatedIndicator.tsx": "Shows how many seconds ago market data was updated, refreshing once per second. Hides itself if no timestamp is provided.",
  "frontend/src/components/market/MobileTickerSearchDialog.tsx": "Mobile-friendly dialog for ticker search using the typeahead component. Manages internal query state and closes on selection.",
  "frontend/src/components/market/TickerTypeahead.tsx": "Implements a debounced ticker search input with dropdown results, keyboard navigation, and selection handling. Manages open/close behavior and loading states.",
  "frontend/src/components/portfolio/AddEditHoldingModal.tsx": "Modal for adding or editing a holding using ticker search and position inputs. Validates fields, builds a Holding object, and submits via mutation.",
  "frontend/src/components/portfolio/CreatePortfolioDialog.tsx": "Dialog for creating a new portfolio with a name field. Submits creation via mutation and handles actor readiness state.",
  "frontend/src/components/portfolio/DeletePortfolioDialog.tsx": "Confirmation dialog for deleting a portfolio, calling the delete mutation and navigating home on success. Shows pending and error states.",
  "frontend/src/components/portfolio/HoldingsTable.tsx": "Displays a searchable holdings table, computing metrics from quotes and supporting edit, remove, and price overrides.",
  "frontend/src/components/portfolio/PortfolioCard.tsx": "Renders a clickable card summarizing portfolio value, daily changes, return, and a sparkline chart.",
  "frontend/src/components/portfolio/PortfolioSharingPanel.tsx": "Provides controls to toggle public visibility of a portfolio and copy a generated public URL.",
  "frontend/src/components/portfolio/RemoveHoldingConfirm.tsx": "Shows a confirmation dialog for removing a holding and triggers the remove mutation.",
  "frontend/src/components/theme/PublicThemeProvider.tsx": "Forces light theme on public pages using next-themes.",
  "frontend/src/hooks/actorReady.ts": "Polls React Query for an initialized actor and errors on timeout or failed actor queries.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous actor, invalidating dependent queries on change.",
  "frontend/src/hooks/useDebouncedValue.ts": "Returns a debounced version of a value after a specified delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Handles Internet Identity login state, persistence, and context access for authenticated identities.",
  "frontend/src/hooks/useMarketData.ts": "Fetches live quotes for stocks and crypto using React Query, caches results, and normalizes symbol handling.",
  "frontend/src/hooks/usePortfolioSimulation.ts": "Manages portfolio simulation state with toggles, overrides, and global move controls.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for CRUD operations on portfolios and holdings via the backend actor.",
  "frontend/src/hooks/useTheme.ts": "Handles light/dark theme state with localStorage persistence and DOM updates.",
  "frontend/src/index.css": "Defines Tailwind base styles, CSS variables for themes, and global layout rules.",
  "frontend/src/lib/portfolioMath.ts": "Computes holding and portfolio metrics using live quotes, avoiding fallback to stored prices.",
  "frontend/src/lib/simulationQuotes.ts": "Generates simulated quote data using overrides or global moves applied to live quotes.",
  "frontend/src/lib/symbols.ts": "Provides crypto ID mapping and utilities for parsing Yahoo and crypto API data.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and Internet Identity providers.",
  "frontend/src/pages/DashboardPage.tsx": "Displays user portfolios with live quotes, loading states, and last-updated info.",
  "frontend/src/pages/PortfolioDetailPage.tsx": "Displays a detailed portfolio view with live or simulated quotes, editing modals, and performance/allocation charts.",
  "frontend/src/pages/PublicPortfolioPage.tsx": "Renders a public, read‑only portfolio view with live or simulated quotes, metrics, and charts, handling privacy/errors.",
  "frontend/src/pages/TickerPreviewPage.tsx": "Shows current and historical pricing for a ticker with charts and crypto detection.",
  "frontend/src/utils/formatters.ts": "Provides a helper to format numbers as signed USD currency strings.",
  "frontend/src/utils/textSearch.ts": "Implements case‑insensitive text normalization and simple query‑matching helpers.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL/session parameters including hash‑based routing support.",
  "frontend/tailwind.config.js": "TailwindCSS configuration customizing colors, fonts, breakpoints, and animations.",
  "project_state.json": "Project metadata describing schema, feature requests, and backend price‑enrichment requirements."
}