{
  "backend/main.mo": "Actor managing user profiles, portfolios, and Yahoo Finance HTTP outcalls with access control enforcement. Provides CRUD-like portfolio access and market data fetch functions.",
  "feature_evidence.json": "Feature evidence report describing case-insensitive holdings search and listing related files, components, and test references.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend files covering routing, hooks, components, charts, and UI behavior.",
  "frontend/index.css": "Tailwind base setup defining OKLCH theme variables for light and dark modes along with global background and border styles.",
  "frontend/index.html": "Minimal HTML entry point loading the React app and favicon.",
  "frontend/src/App.tsx": "Top‑level app component handling hash‑based routing, authentication flow, and theme selection for public vs authenticated routes.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and query cache clearing on logout.",
  "frontend/src/components/charts/AllocationDonutChart.tsx": "Renders a Recharts donut chart showing allocation by holding, using live quotes or fallback prices.",
  "frontend/src/components/charts/PerformanceLineChart.tsx": "Renders a portfolio performance line chart using historical data with range selector and error/loading states.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides the main layout with responsive sidebar behavior and a top navigation bar, wrapping all page content.",
  "frontend/src/components/layout/Sidebar.tsx": "Displays portfolios, live metrics, and navigation actions, including creating new portfolios.",
  "frontend/src/components/layout/TopNav.tsx": "Renders the top navigation bar with theme toggle, ticker search, portfolio switcher, and mobile menu handling.",
  "frontend/src/components/market/LastUpdatedIndicator.tsx": "Shows how many seconds ago data was last updated, refreshing every second.",
  "frontend/src/components/market/MobileTickerSearchDialog.tsx": "Mobile dialog wrapper for ticker search with typeahead selection and closing behavior.",
  "frontend/src/components/market/TickerTypeahead.tsx": "Provides debounced ticker search with dropdown results, keyboard navigation, and selection handling.",
  "frontend/src/components/portfolio/AddEditHoldingModal.tsx": "Modal for adding or editing a holding, including ticker search and form validation before mutation.",
  "frontend/src/components/portfolio/CreatePortfolioDialog.tsx": "Dialog for creating a new portfolio with name input and mutation handling.",
  "frontend/src/components/portfolio/DeletePortfolioDialog.tsx": "Confirmation dialog that deletes a portfolio using a mutation and navigates home on success.",
  "frontend/src/components/portfolio/HoldingsTable.tsx": "Displays portfolio holdings with metrics, search, optional edit/remove actions, and price overrides.",
  "frontend/src/components/portfolio/PortfolioCard.tsx": "Clickable portfolio summary card showing total value, returns, and a sparkline chart.",
  "frontend/src/components/portfolio/PortfolioSharingPanel.tsx": "Panel to toggle public visibility of a portfolio and copy its public share URL.",
  "frontend/src/components/portfolio/RemoveHoldingConfirm.tsx": "Dialog confirming removal of a holding and executing the remove mutation.",
  "frontend/src/components/theme/PublicThemeProvider.tsx": "Theme provider that forces light mode for public-facing pages.",
  "frontend/src/hooks/actorReady.ts": "Utility that waits for an actor to appear in React Query cache, with timeout and error handling.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches a backend actor based on identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useDebouncedValue.ts": "Hook returning a debounced version of a changing value.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity auth state, loading, login, and identity storage.",
  "frontend/src/hooks/useMarketData.ts": "React-query hooks fetch live quotes, search results, and historical data for stocks and crypto, including crypto ID resolution and parsing utilities.",
  "frontend/src/hooks/usePortfolioSimulation.ts": "Manages portfolio simulation state with global price moves and per-ticker overrides.",
  "frontend/src/hooks/useQueries.ts": "React-query hooks handle CRUD operations for portfolios and holdings through the backend actor.",
  "frontend/src/hooks/useTheme.ts": "Stores and toggles light/dark theme with persistence and DOM class updates.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables define light/dark themes and layout rules.",
  "frontend/src/lib/portfolioMath.ts": "Computes holding- and portfolio-level metrics including market value, returns, and daily changes.",
  "frontend/src/lib/simulationQuotes.ts": "Generates simulated quote data by applying overrides or global moves to live prices.",
  "frontend/src/lib/symbols.ts": "Provides crypto ID mapping and parsing utilities for Yahoo Finance and CoinGecko responses.",
  "frontend/src/main.tsx": "App entry point initializing React, query client, and Internet Identity provider.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page loads portfolios, fetches related quotes, and renders portfolio cards with loading states.",
  "frontend/src/pages/PortfolioDetailPage.tsx": "Portfolio detail page that loads a user’s portfolio, live/simulated quotes, calculates metrics, and renders holdings, charts, and management modals.",
  "frontend/src/pages/PublicPortfolioPage.tsx": "Public view of a shared portfolio including live/simulated quotes, metrics, charts, and error handling for private or missing portfolios.",
  "frontend/src/pages/TickerPreviewPage.tsx": "Displays live price, change data, and a 30‑day chart for a single stock or crypto ticker using live and historical market data.",
  "frontend/src/utils/formatters.ts": "Provides a helper to format numbers as signed USD strings with two decimal places.",
  "frontend/src/utils/textSearch.ts": "Implements basic case‑insensitive text normalization and substring search utilities.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters and session‑stored values, including hash‑based routing support.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending theme colors, fonts, breakpoints, animations, and enabling plugins.",
  "project_state.json": "Project metadata and state tracking, including a pending feature request to make holdings search case‑insensitive."
}