{
  "backend/main.mo": "Motoko backend defining user profiles, portfolios, holdings, and Yahoo Finance HTTP outcalls with authorization checks.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, related files, components, and test references.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each frontend file's purpose and behavior.",
  "frontend/index.css": "Tailwind base/theme variables defining light and dark color schemes and shared layout styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app handling hash-based routing, authentication states, and theme switching for public vs authenticated views.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and query cache clearing.",
  "frontend/src/components/charts/AllocationDonutChart.tsx": "Donut chart showing portfolio allocation based on holdings with live quotes and graceful empty-state handling.",
  "frontend/src/components/charts/PerformanceLineChart.tsx": "Line chart displaying historical performance for a selected asset with range selection and loading/error states.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides the main app layout with responsive sidebar handling and top navigation, adjusting sidebar visibility based on screen size.",
  "frontend/src/components/layout/Sidebar.tsx": "Displays portfolios with live metrics, allows navigation, and includes a dialog for creating new portfolios.",
  "frontend/src/components/layout/TopNav.tsx": "Renders the top navigation bar with sidebar toggle, ticker search, theme switcher, and portfolio dropdown.",
  "frontend/src/components/market/LastUpdatedIndicator.tsx": "Shows how many seconds ago market data was updated, refreshing every second.",
  "frontend/src/components/market/MobileTickerSearchDialog.tsx": "Mobile-friendly dialog for searching and selecting ticker symbols using a typeahead input.",
  "frontend/src/components/market/TickerTypeahead.tsx": "A debounced ticker search input with keyboard navigation and a dropdown of live search results.",
  "frontend/src/components/portfolio/AddEditHoldingModal.tsx": "Modal for adding or editing a holding with ticker selection, share and cost inputs, and form validation.",
  "frontend/src/components/portfolio/CreatePortfolioDialog.tsx": "Dialog for creating a new portfolio with name input and submission via mutation.",
  "frontend/src/components/portfolio/DeletePortfolioDialog.tsx": "Confirmation dialog that triggers a portfolio deletion mutation and navigates home on success.",
  "frontend/src/components/portfolio/HoldingsTable.tsx": "Displays and filters portfolio holdings with metrics, search, and optional price overrides, with loading and empty states.",
  "frontend/src/components/portfolio/PortfolioCard.tsx": "Shows a portfolio summary card with value, daily change, return metrics, and a sparkline, navigating to the portfolio on click.",
  "frontend/src/components/portfolio/PortfolioSharingPanel.tsx": "Allows toggling portfolio public visibility and provides a copyable public URL when enabled.",
  "frontend/src/components/portfolio/RemoveHoldingConfirm.tsx": "Confirmation dialog for removing a holding by calling a mutation and showing success or error toasts.",
  "frontend/src/components/theme/PublicThemeProvider.tsx": "Theme provider that forces light mode for public-facing screens.",
  "frontend/src/hooks/actorReady.ts": "Polls React Query for an available actor instance and errors out if unavailable or failing within a timeout.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Provides a debounced version of a value with a configurable delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for managing authentication state, login, logout, and stored identities.",
  "frontend/src/hooks/useMarketData.ts": "Provides React Query hooks to fetch and cache live quotes and crypto IDs using actor APIs, handling both crypto and Yahoo data sources.",
  "frontend/src/hooks/usePortfolioSimulation.ts": "Manages simulation state for portfolio price changes, including toggles, overrides, and resets.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on portfolios and holdings through the backend actor.",
  "frontend/src/hooks/useTheme.ts": "Stores and toggles light/dark theme with persistence in localStorage and DOM class updates.",
  "frontend/src/index.css": "Tailwind setup defining light/dark CSS variables and base styling, including overflow prevention.",
  "frontend/src/lib/portfolioMath.ts": "Computes holding and portfolio metrics strictly from live quotes, including market value, returns, and daily changes.",
  "frontend/src/lib/simulationQuotes.ts": "Generates simulated quotes based on overrides or global moves, falling back to live quotes only when no simulation applies.",
  "frontend/src/lib/symbols.ts": "Provides crypto ID mappings and utilities to parse Yahoo and crypto responses for quotes, search, and historical data.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/DashboardPage.tsx": "Fetches portfolios and live quotes to render the dashboard, showing loading skeletons and portfolio cards.",
  "frontend/src/pages/PortfolioDetailPage.tsx": "Renders the main portfolio detail view with live/simulated quotes, metrics, charts, and holding management modals. Handles loading, missing portfolio states, and simulation controls.",
  "frontend/src/pages/PublicPortfolioPage.tsx": "Displays a read-only public portfolio with live/simulated quotes, metrics, and charts. Handles loading, access errors, and simulation mode without edit features.",
  "frontend/src/pages/TickerPreviewPage.tsx": "Shows a single asset’s current quote and 30‑day chart using live and historical data. Determines crypto vs stock and provides simple navigation back.",
  "frontend/src/utils/formatters.ts": "Provides a helper to format numbers as signed USD strings with two decimal places.",
  "frontend/src/utils/textSearch.ts": "Implements text normalization and case‑insensitive substring matching for search.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters across normal and hash routing using sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, screens, animations, and plugin setup for the frontend.",
  "project_state.json": "Tracks the project’s state, features, requirements, and architectural notes regarding crypto data fallback behavior."
}