{
  "backend/main.mo": "Actor implementing access‑controlled user profiles, portfolios, and Yahoo Finance data fetching via http outcalls.",
  "feature_evidence.json": "Feature evidence report listing enforced light‑mode requirements and related files, components, and tests.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend components, hooks, utilities, and pages.",
  "frontend/index.css": "Tailwind base theme definitions with full light/dark OKLCH variable sets and global styling.",
  "frontend/index.html": "Basic HTML shell mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main app router handling public vs authenticated routes and enforcing forced light mode on unauthenticated screens.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button wired to Internet Identity with loading states and cache clearing on logout.",
  "frontend/src/components/charts/AllocationDonutChart.tsx": "Recharts donut chart computing holding values and rendering allocation with legend and tooltips.",
  "frontend/src/components/charts/PerformanceLineChart.tsx": "Recharts line chart fetching historical data per selected range to show portfolio performance.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with a top nav, toggleable sidebar, and responsive content container.",
  "frontend/src/components/layout/Sidebar.tsx": "Displays portfolios with live metrics and navigation, plus a dialog for creating new portfolios.",
  "frontend/src/components/layout/TopNav.tsx": "Renders the fixed top navigation bar with logo, portfolio switcher, ticker search, theme toggle, and login.",
  "frontend/src/components/market/LastUpdatedIndicator.tsx": "Shows a live-updating timestamp indicating how many seconds ago data was refreshed.",
  "frontend/src/components/market/TickerTypeahead.tsx": "Provides a searchable ticker input with debounced API queries, dropdown results, and keyboard navigation.",
  "frontend/src/components/portfolio/AddEditHoldingModal.tsx": "Modal for adding or editing a holding with ticker search, validation, and mutation submission.",
  "frontend/src/components/portfolio/CreatePortfolioDialog.tsx": "Dialog for creating a new portfolio with name input and mutation handling.",
  "frontend/src/components/portfolio/DeletePortfolioDialog.tsx": "Confirmation dialog to delete a portfolio and navigate home after completion.",
  "frontend/src/components/portfolio/HoldingsTable.tsx": "Renders a holdings table with metrics, live/override pricing, and edit/remove actions, including loading and empty states.",
  "frontend/src/components/portfolio/PortfolioCard.tsx": "Displays a portfolio summary card with value, daily changes, sparkline chart, and navigation to the portfolio view.",
  "frontend/src/components/portfolio/PortfolioSharingPanel.tsx": "Allows toggling portfolio public visibility and provides a shareable public URL with copy support.",
  "frontend/src/components/portfolio/RemoveHoldingConfirm.tsx": "Confirmation dialog for removing a holding, performing the mutation and showing toast feedback.",
  "frontend/src/components/theme/PublicThemeProvider.tsx": "Theme provider forcing light mode for public pages without system preference detection.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Returns a debounced version of a value after a configurable delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login flow, and identity persistence via AuthClient.",
  "frontend/src/hooks/useMarketData.ts": "Fetches live quotes, ticker search results, and handles both Yahoo Finance and crypto sources with caching and parsing.",
  "frontend/src/hooks/usePortfolioSimulation.ts": "Manages simulation state for portfolio pricing, including toggles, global moves, and per-ticker overrides.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating portfolios and holdings via the backend actor.",
  "frontend/src/hooks/useTheme.ts": "Handles light/dark theme persistence and toggling using local storage and root CSS classes.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for light/dark themes, global styles, and design tokens.",
  "frontend/src/lib/portfolioMath.ts": "Computes holding and portfolio metrics such as market value, returns, and daily changes using quote data.",
  "frontend/src/lib/simulationQuotes.ts": "Generates simulated quote data based on live quotes and simulation parameters like global moves and overrides.",
  "frontend/src/lib/symbols.ts": "Contains crypto ID mapping, symbol utilities, and parsers for Yahoo Finance and CoinGecko responses.",
  "frontend/src/main.tsx": "Initializes the React app with Internet Identity and React Query providers and loads global styles.",
  "frontend/src/pages/DashboardPage.tsx": "Displays the list of user portfolios with live quotes and loading states on the dashboard.",
  "frontend/src/pages/PortfolioDetailPage.tsx": "Shows detailed portfolio metrics, charts, holdings, and simulation controls with data from live or simulated quotes.",
  "frontend/src/pages/PublicPortfolioPage.tsx": "Displays a public portfolio with live or simulated quotes, portfolio metrics, charts, and holdings, with simulation controls and loading/error states.",
  "frontend/src/pages/TickerPreviewPage.tsx": "Shows live and historical price data for a given ticker, including current pricing, crypto detection, and a 30‑day line chart.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and cleaning parameters from hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, typography, animations, and plugin integration for the project.",
  "project_state.json": "Defines project metadata, known issues, and feature requests related to enforcing light mode on public pages."
}