{
  "kind": "build_request",
  "title": "Fix backend pricing enrichment so every holding returns price data",
  "projectName": "Portfolio Tracker",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the backend so portfolio retrieval returns price data for every holding in every returned portfolio (not just a single holding), by enriching holdings on the backend before returning them.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "It returns all holdings but the price data only appears for one holding.",
          "Each holding should have price data",
          "1. Backend"
        ]
      },
      "acceptanceCriteria": [
        "Calling getPortfolios returns the same portfolios/holdings list as before, but each holding includes populated currentPrice fields (price, change, changePercent, currency).",
        "Price enrichment is applied to every holding in every portfolio returned by getPortfolios, not just the first holding.",
        "The enrichment logic works for portfolios containing multiple holdings (e.g., 3+ tickers) and does not stop after enriching one holding."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Apply the same backend holding price enrichment behavior to public portfolio reads so getPublicPortfolio returns holdings with price data for every holding.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Each holding should have price data",
          "1. Backend"
        ]
      },
      "acceptanceCriteria": [
        "Calling getPublicPortfolio for a public portfolio returns holdings where every holding includes populated currentPrice fields.",
        "Authorization/public-privacy rules remain unchanged (non-public portfolios still trap as before)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure backend enrichment is efficient and reliable when fetching prices for multiple holdings, and that partial failures do not prevent other holdings from being enriched and returned.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "whatever is most efficient and reliable."
        ]
      },
      "acceptanceCriteria": [
        "If one holding’s external price lookup fails, the backend still returns the full portfolios response and still enriches other holdings that can be priced.",
        "The backend does not trap solely due to a single holding’s price fetch failing (unless an existing authorization/validation rule is violated).",
        "Crypto price lookups continue to use the existing primary+fallback behavior (CoinGecko with CoinPaprika fallback) without introducing any user-facing indicators."
      ]
    }
  ],
  "constraints": [
    "Keep all Motoko logic within the single backend actor in backend/main.mo (single-actor architecture).",
    "Use English for any user-facing text returned by the backend (e.g., trap messages)."
  ],
  "nonGoals": [
    "Do not move price enrichment to the frontend.",
    "Do not add new third-party providers beyond the existing Yahoo Finance outcalls and CoinGecko/CoinPaprika crypto fallback.",
    "Do not introduce UI alerts/banners/toasts related to fallback usage."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}