{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Force light theme on all public/unauthenticated screens",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Render public portfolio, login, and initializing screens in forced light mode regardless of OS/system theme or stored preference, while leaving authenticated routes unchanged.",
      "acceptanceCriteria": [
        "When visiting the public portfolio route (#/public/:owner/:portfolio), the UI renders in light theme even if the user previously selected dark mode or the OS is in dark mode.",
        "When the app is in the unauthenticated state (login screen), the UI renders in light theme even if the user previously selected dark mode or the OS is in dark mode.",
        "When the app is in the initializing/loading state, the UI renders in light theme even if the user previously selected dark mode or the OS is in dark mode.",
        "Authenticated routes continue to use the existing theme behavior (including the current dark default and any in-app theme toggle behavior)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/theme/PublicThemeProvider.tsx",
          "operation": "create",
          "description": "Create a small wrapper around next-themes ThemeProvider that enforces light mode for public/unauthenticated screens only (forced light, no system)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wrap the public portfolio route render, initialization/loading screen, and unauthenticated/login screen with the new PublicThemeProvider so these screens are always light, while keeping the existing ThemeProvider configuration for authenticated routes unchanged."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Configure the theme provider used by public/unauthenticated routes to consistently apply the `light` root class and prevent override by system theme or persisted preferences, without touching immutable hook files.",
      "acceptanceCriteria": [
        "Theme provider for public/unauthenticated routes uses a forced light theme configuration (e.g., forcedTheme/light default + enableSystem disabled) so dark mode styling never applies on those routes.",
        "No changes are made to immutable hook files (e.g., `frontend/src/hooks/useInternetIdentity.ts` and `frontend/src/hooks/useActor.ts`)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/theme/PublicThemeProvider.tsx",
          "operation": "modify",
          "description": "Set next-themes provider options for public/unauthenticated routes to force `light` and disable system theme following, ensuring the document root class remains `light` even if a persisted preference exists."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the public/unauthenticated ThemeProvider usage to rely exclusively on PublicThemeProvider (forced light), ensuring no other theme configuration is applied to those route branches."
        }
      ]
    }
  ]
}