{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-17T18:03:48.548Z",
  "summary": "Frontend market-data parsing and caching logic was updated to validate crypto data and (per comments/summaries) handle both CoinGecko and CoinPaprika response shapes, but the diff summary does not provide evidence that the backend actually implements CoinPaprika HTTP-outcall fallback for the required crypto endpoints.",
  "missing_requirements": [
    {
      "id": "REQ-4",
      "requirement": "Implement an automatic fallback to CoinPaprika for all crypto market-data HTTP outcalls when CoinGecko requests fail (network error, non-2xx response, invalid JSON, or missing expected fields), while keeping CoinGecko as the primary source, for searchCryptoTickers, getCryptoLivePrice, and getCryptoHistoricalData.",
      "reason": "The provided backend diff excerpt shows only Yahoo-related HTTP outcalls and does not show any CoinGecko/CoinPaprika HTTP calls nor fallback/retry logic for the crypto endpoints; the relevant sections may be outside the truncated portion, but no evidence is present in the diff summary.",
      "evidence": [
        "backend/main.mo (truncated excerpt shows fetchYahooData/fetchHistoricalData/searchTickers only; no CoinGecko/CoinPaprika fallback shown)"
      ]
    },
    {
      "id": "REQ-5",
      "requirement": "Use CoinPaprika as the only fallback provider and support automatic switching back to CoinGecko on subsequent requests once CoinGecko becomes available again (no sticky fallback mode).",
      "reason": "No backend implementation details are shown that attempt CoinGecko first and then fallback to CoinPaprika per-request; no evidence of non-sticky behavior is present in the diff summary.",
      "evidence": [
        "backend/main.mo (truncated; no provider-selection logic shown)"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Random/mock price and historical values returned when Yahoo parsing fails (instead of failing/returning an error).",
      "reason": "Not requested in the BuildRequest (which focuses on adding CoinPaprika fallback for crypto when CoinGecko is unavailable). Introducing random data changes behavior and could mask real parsing/outage issues.",
      "evidence": [
        "frontend/src/lib/symbols.ts (parseYahooQuote uses random fallback values; parseYahooHistorical generates synthetic series)"
      ]
    }
  ],
  "confidence": 0.62,
  "changed_files": [
    "backend/main.mo",
    "frontend-file-summaries.txt",
    "frontend/src/hooks/useMarketData.ts",
    "frontend/src/lib/symbols.ts",
    "project_state.json"
  ]
}